In [3]:
import pandas as pd
import seaborn as sns

a=pd.read_csv("C:/Users/Windows 10/Downloads/universities_ranking1.csv")

In [5]:
#preparing data and creating dataframe
a.head()

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
0,1,University of Oxford,United Kingdom,"20,774",11.1,41%,46 : 54
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61

In [6]:
#checking data charactoristics
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1526 entries, 0 to 1525
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   ranking               1526 non-null   int64
 1   title                 1526 non-null   object
 2   location              1526 non-null   object
 3   number students       1526 non-null   object
 4   students staff ratio  1526 non-null   float64
 5   perc intl students    1526 non-null   object
 6   gender ratio          1453 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 83.6+ KB

In [7]:
#search for any NaN(missing data) in data
a.isnull().sum()

ranking                  0
title                    0
location                 0
number students          0
students staff ratio     0
perc intl students       0
gender ratio            73
dtype: int64

In [8]:
a.isnull().sum().sum()

73

In [9]:
#deleting missing data
#delete column
new_a=a.dropna(axis=1,thresh=500)#command to delete all column with more NaN values
new_a.head()

,ranking,title,location,number students,students staff ratio,perc intl students,gender ratio
0,1,University of Oxford,United Kingdom,"20,774",11.1,41%,46 : 54
1,2,Stanford University,United States,"16,223",7.4,23%,44 : 56
2,3,Harvard University,United States,"21,261",9.3,25%,49 : 51
3,4,California Institute of Technology,United States,"2,238",6.3,33%,36 : 64
4,5,Massachusetts Institute of Technology,United States,"11,276",8.4,34%,39 : 61

In [10]:
#delete row
gender_a=a.dropna(axis=0,how='any',subset=['gender ratio'])
len(gender_a)

1453

In [12]:
#delete column result
no=a.dropna()
no.isnull().sum()

ranking                 0
title                   0
location                0
number students         0
students staff ratio    0
perc intl students      0
gender ratio            0
dtype: int64